# ConnectorManager Property

---
C#Visual BasicVisual C++
Revit 2024 API
---
FabricationPart..::..ConnectorManager Property
FabricationPart Class See Also
---
The connector manager of the fabrication part.
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)**Since:** 2016
# Syntax
C#
---
```text
public ConnectorManager ConnectorManager { get; }
```

Visual Basic
---
```text
Public ReadOnly Property ConnectorManager As ConnectorManager
	Get
```

Visual C++
---
```text
public:
property ConnectorManager^ ConnectorManager {
	ConnectorManager^ get ();
}
```

# See Also
FabricationPart Class
Autodesk.Revit.DB Namespace